/*********************************************************************************
  *Copyright(C),GeeSpace
  *FileName:  skdy_sdk.h
  *Author:  wangtao
  *Version:  v1.0
  *Date:  2020-08-27
  *Description:  
	用户SDK的API接口函数

  *History: 

**********************************************************************************/


#ifndef SKDY_SDK_H
#define SKDY_SDK_H

#ifdef __cplusplus
extern "C" {
#endif

#include "skdy_types.h"
#include"icdParser.h"

extern skdy_int8_t skdy_sdk_need_int;
extern skdy_int32_t skdy_nowArea;
extern skdy_uint32_t skdy_sdk_data_arrive;
//#define SKDY_USE_TLS

//==================================================================
//函数名：  skdy_sdk_data_callback_t
//作者：    liupeng
//日期：    2020-08-27
//功能：    数据接收回调函数
//修改记录：
//==================================================================
typedef void(*skdy_sdk_data_callback_t)(pppcorr_msg_t* data);


//==================================================================
//函数名：  skdy_init_t
//作者：    liupeng
//日期：    2020-09-4
//功能：    初始化数据结构体
//修改记录：
//==================================================================
typedef struct {
	skdy_char_t key[512];
	skdy_char_t secret[512];

	skdy_sdk_data_callback_t data_callback;
}skdy_init_t;

//==================================================================
//函数名：  skdy_point_position_t
//作者：    liupeng
//日期：    2020-09-4
//功能：    向SDK输入单点定位信息
//修改记录：
//==================================================================
typedef struct {
	skdy_float64_t longitude;
	skdy_float64_t latitude;
}skdy_point_position_t;


//==================================================================
//函数名：  SKDY_Ser_SDK_Init
//作者：    wangtao
//日期：    2020-08-27
//功能：    用户SDK初始化
//输入参数：无
//返回值：  类型（skdy_uint32_t)
//          返回1代表成功
//			返回其它值代表失败
//修改记录：
//==================================================================
skdy_int32_t  SKDY_Ser_SDK_Init(skdy_init_t* skdy_init);

//==================================================================
//函数名：  SKDY_Ser_SetAuth
//作者：    wangtao
//日期：    2020-08-27
//功能：    用户设置鉴权信息
//输入参数：key			秘钥
//			secret		密码
//返回值：  类型（skdy_uint32_t)
//          返回1代表成功
//			返回其它值代表失败
//修改记录：
//==================================================================

//skdy_int32_t SKDY_Ser_SetAuth(void);


//==================================================================
//函数名：  SKDY_Ser_CertAuth
//作者：    wangtao
//日期：    2020-08-27
//功能：    进行鉴权
//输入参数：无
//返回值：  类型（skdy_uint32_t)
//          返回1代表成功
//			返回其它值代表失败
//修改记录：
//==================================================================

skdy_int32_t SKDY_Ser_CertAuth(void);

//==================================================================
//函数名：  SKDY_Point_Position_Update
//作者：    liupeng
//日期：    2020-09-07
//功能：    向SDK输入单点定位信息以获取所在区域，此函数建议5秒调用一次
//输入参数：输入GNSS的粗略定位信息
//返回值：  类型（skdy_uint32_t)
//          返回1代表成功
//			返回其它值代表失败
//修改记录：
//==================================================================
skdy_int32_t SKDY_Point_Position_Update(skdy_point_position_t* point_position);
//==================================================================
//函数名：  SKDY_Rec_Start
//作者：    wangtao
//日期：    2020-08-27
//功能：    开始接收服务器播发的数据
//输入参数：无
//返回值：  类型（skdy_uint32_t)
//          返回1代表成功
//			返回其它值代表失败
//修改记录：
//==================================================================

skdy_int32_t SKDY_Rec_Start(void);




//==================================================================
//函数名：  SKDY_Ser_CtrlRecord
//作者：    wangtao
//日期：    2020-08-27
//功能：    设置是否开启记录功能，以及记录路径。若路径不存在，函数返回失败值。
//输入参数：无
//返回值：  类型（skdy_uint32_t)
//          返回1代表成功
//			返回其它值代表失败
//修改记录：
//==================================================================
skdy_int32_t SKDY_Ser_CtrlRecord(skdy_bool_t control , skdy_char_t* PATH );


//==================================================================
//函数名：  SKDY_Ser_CtrlLog
//作者：    wangtao
//日期：    2020-08-27
//功能：    设置是否开启日志功能，以及日志路径，若路径不存在，函数返回失败值。
//输入参数：无
//返回值：  类型（skdy_uint32_t)
//          返回1代表成功
//			返回其它值代表失败
//修改记录：
//==================================================================
skdy_int32_t SKDY_Ser_CtrlLog(skdy_bool_t control , skdy_char_t* PATH );


//==================================================================
//函数名：  SKDY_Ser_CertAuth
//作者：    wangtao
//日期：    2020-08-27
//功能：    获取SDK当前状态
//输入参数：无
//返回值：  类型（skdy_uint32_t)
//          返回1代表成功
//			返回其它值代表失败
//修改记录：
//==================================================================
skdy_int32_t SKDY_Ser_GetStatus(void);

//==================================================================
//函数名：  SKDY_Ser_CtrlGadPath
//作者：    liupeng
//日期：    2020-09-04
//功能：    设置区域表数据存储位置。
//输入参数：无
//返回值：  类型（skdy_uint32_t)
//          返回1代表成功
//			返回其它值代表失败
//修改记录：
//==================================================================
skdy_int32_t SKDY_Ser_CtrlGadPath(skdy_char_t* PATH);

//==================================================================
//函数名：  SKDY_Mqtts_Disconnect
//作者：    wangtao
//日期：    2021-01-19
//功能：    断开播发平台。
//输入参数：无
//返回值：  类型（skdy_int32_t)
//          返回1代表成功
//			返回其它值代表失败
//修改记录：
//==================================================================
skdy_int32_t SKDY_Mqtts_Disconnect(void);

#ifdef __cplusplus
}
#endif

#endif

